---
kind: method
id: M:Autodesk.Revit.DB.ExportLineweightTableIterator.MoveNext
source: html/281d3c22-5504-96a6-396d-591acd9d9cd0.htm
---
# Autodesk.Revit.DB.ExportLineweightTableIterator.MoveNext Method

Increments the iterator to the next item.

## Syntax (C#)
```csharp
public virtual bool MoveNext()
```

## Returns
True if the iteration has no more items. False if there are more items to be iterated.